app/Models/ModelUnit.php

SELECT *
FROM `tbl_unit`
---
    public function all_data()
    {
        return $this->db->table('tbl_unit')
            ->get()->getResultArray();

SELECT *
FROM `tbl_unit`
WHERE `nama_unit` LIKE '%%'
ORDER BY `nama_unit` DESC
 LIMIT 10
---
    function get_datatables()
    {
        if (isset($_POST['search']['value'])) {

            $search = $_POST['search']['value'];
            $kondisi_search = "nama_unit LIKE '%$search%'";
        } else {
            $kondisi_search = "id_unit!= ''";
        }

        // order
        if (isset($_POST['order'])) {
            $result_order = $this->column_order[$_POST['order']['0']['column']];
            $result_dir = $_POST['order']['0']['dir'];
        } else if ($this->order) {
            $order = $this->order;
            $result_order = key($order);
            $result_dir = $order[key($order)];
        }


        if (isset($_POST['length'])) {
            if ($_POST['length'] != -1)
                ;
            $db = db_connect();
            $builder = $db->table('tbl_unit');
            $query = $builder->select('*')
                ->where($kondisi_search)
                ->orderBy($result_order, $result_dir)
                ->limit($_POST['length'], $_POST['start'])
                ->get();

UPDATE `tbl_unit` SET `nama_unit` = 'Subbagian Umum'
WHERE `id_unit` = '1'
---
    function edit_data($data, $id_unit)
    {
        return $this->db->table('tbl_unit')->update($data, array('id_unit' => $id_unit));