app/Models/ModelAdmin.php

SELECT *
FROM `tbl_user`
---
    public function all_data()
    {
        return $this->db->table('tbl_user')
            ->get()->getResultArray();

SELECT *
FROM `tbl_user`
WHERE `username` LIKE '%%' OR `password` LIKE '%%' OR `level` LIKE '%%' OR `status` LIKE '%%' OR `info` LIKE '%%'
ORDER BY `username` DESC
 LIMIT 10
---
    function get_datatables()
    {
        if (isset($_POST['search']['value'])) {

            $search = $_POST['search']['value'];
            $kondisi_search = "username LIKE '%$search%' OR password LIKE '%$search%' OR level LIKE '%$search%' OR status LIKE '%$search%' OR info LIKE '%$search%'";
        } else {
            $kondisi_search = "id_user != ''";
        }



        // order
        if (isset($_POST['order'])) {
            $result_order = $this->column_order[$_POST['order']['0']['column']];
            $result_dir = $_POST['order']['0']['dir'];
        } else if ($this->order) {
            $order = $this->order;
            $result_order = key($order);
            $result_dir = $order[key($order)];
        }


        if (isset($_POST['length'])) {
            if ($_POST['length'] != -1)
                ;
            $db = db_connect();
            $builder = $db->table('tbl_user');
            $query = $builder->select('*')
                ->where($kondisi_search)
                ->orderBy($result_order, $result_dir)
                ->limit($_POST['length'], $_POST['start'])
                ->get();