app/Models/ModelAuth.php

    public function cekLogin($username, $password)
    {
        return $this->db->table('tbl_user')
            ->where([
                'username' => $username,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'Mukhlis'
AND `password` = '7c4a8d09ca3762af61e59520943dc26494f8941b'