app/Models/ModelPegawai.php

SELECT *
FROM `tbl_pegawai`
---
    public function all_data()
    {
        return $this->db->table('tbl_pegawai')
            ->get()->getResultArray();

SELECT *
FROM `tbl_pegawai`
WHERE `nama_pegawai` LIKE '%%' OR `nip` LIKE '%%' OR `jabatan` LIKE '%%' OR `status` LIKE '%%'
ORDER BY `nama_pegawai` ASC
 LIMIT 10
---
    function get_datatables()
    {
        if (isset($_POST['search']['value'])) {

            $search = $_POST['search']['value'];
            $kondisi_search = "nama_pegawai LIKE '%$search%' OR nip LIKE '%$search%' OR jabatan LIKE '%$search%' OR status LIKE '%$search%'";
        } else {
            $kondisi_search = "id_pegawai!= ''";
        }



        // order
        if (isset($_POST['order'])) {
            $result_order = $this->column_order[$_POST['order']['0']['column']];
            $result_dir = $_POST['order']['0']['dir'];
        } else if ($this->order) {
            $order = $this->order;
            $result_order = key($order);
            $result_dir = $order[key($order)];
        }


        if (isset($_POST['length'])) {
            if ($_POST['length'] != -1)
                ;
            $db = db_connect();
            $builder = $db->table('tbl_pegawai');
            $query = $builder->select('*')
                ->where($kondisi_search)
                ->orderBy($result_order, $result_dir)
                ->limit($_POST['length'], $_POST['start'])
                ->get();

UPDATE `tbl_pegawai` SET `nama_pegawai` = 'qwetedit', `nip` = '1231200', `jabatan` = 'Pelaksana', `status` = 'Tidak Aktif'
WHERE `id_pegawai` = '4'
---
    function edit_data($data, $id_pegawai)
    {
        return $this->db->table('tbl_pegawai')->update($data, array('id_pegawai' => $id_pegawai));