app/Models/ModelData.php

    public function all_data()
    {
        return $this->db->table('tbl_data')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_data`

    function get_datatables()
    {
        if (isset($_POST['search']['value'])) {

            $search = $_POST['search']['value'];
            $kondisi_search = "elemenVar LIKE '%$search%' OR elemenNum LIKE '%$search%' OR elementSelect LIKE '%$search%' OR elementRadio LIKE '%$search%' OR elementCheck LIKE '%$search%' OR elementTextArea LIKE '%$search%' OR elementDate LIKE '%$search%'  OR elementImg LIKE '%$search%'  OR elementFile LIKE '%$search%'";
        } else {
            $kondisi_search = "id_data != ''";
        }



        // order
        if (isset($_POST['order'])) {
            $result_order = $this->column_order[$_POST['order']['0']['column']];
            $result_dir = $_POST['order']['0']['dir'];
        } else if ($this->order) {
            $order = $this->order;
            $result_order = key($order);
            $result_dir = $order[key($order)];
        }


        if (isset($_POST['length'])) {
            if ($_POST['length'] != -1)
                ;
            $db = db_connect();
            $builder = $db->table('tbl_data');
            $query = $builder->select('*')
                ->where($kondisi_search)
                ->orderBy($result_order, $result_dir)
                ->limit($_POST['length'], $_POST['start'])
                ->get();
---
SELECT *
FROM `tbl_data`
WHERE `elemenVar` LIKE '%%' OR `elemenNum` LIKE '%%' OR `elementSelect` LIKE '%%' OR `elementRadio` LIKE '%%' OR `elementCheck` LIKE '%%' OR `elementTextArea` LIKE '%%' OR `elementDate` LIKE '%%'  OR `elementImg` LIKE '%%'  OR `elementFile` LIKE '%%'
ORDER BY `id_data` DESC
 LIMIT 10

    function detail($id){
        return $this->db->table('tbl_data')
        ->where('id_data', $id)
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_data`
WHERE `id_data` = '4'